Revit 2022 API
Document.NewFloor Method (CurveArray, Boolean)
 Creates a floor within the project with the given horizontal profile using the default floor style.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in the future version of Revit. To create new instance of Floor, call Floor.Create().")]
public Floor NewFloor(
	CurveArray profile,
	bool structural
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in the future version of Revit. To create new instance of Floor, call Floor.Create().")> _
Public Function NewFloor ( _
	profile As CurveArray, _
	structural As Boolean _
) As Floor
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in the future version of Revit. To create new instance of Floor, call Floor.Create().")]
public:
Floor^ NewFloor(
	CurveArray^ profile,
	bool structural
)
Parameters
profile
Type: Autodesk.Revit.DB.CurveArray
 An array of planar lines and arcs that represent the horizontal profile of the floor.
structural
Type: System.Boolean
 If set, specifies that the floor is structural in nature.
Return Value
 If successful a new floor object within the project, otherwise null.
Remarks
 The curves of the profile must be contiguous and the Face formed by profile should be suitable to create floor.
See Also
Document Class
NewFloor Overload
Autodesk.Revit.Creation Namespace